In [71]:
import pandas as pd # data frame library for Python
import numpy as np # scientific computing library for Python
from statistics import *

In [72]:
# comma separated values file for Titanic passengers
titanic_data = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv")

In [73]:
data = pd.read_csv("D:\\CPSC392\\datasets\\02-titanic.csv")

In [74]:
list_names = ['Erik','Josh','Kim']
list_ages = [21,23,19]
my_dictionary = {"Name":list_names,"Age":list_ages}
my_data = pd.DataFrame(my_dictionary)

In [75]:
 # display data
data

,passengerID,name,age,fare,sex,survived
0,1,"Braund, Mr. Owen Harris",22.0,7.2500,male,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,71.2833,female,1
2,3,"Heikkinen, Miss. Laina",26.0,7.9250,female,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,53.1000,female,1
4,5,"Allen, Mr. William Henry",35.0,8.0500,male,0
...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",27.0,13.0000,male,0
887,888,"Graham, Miss. Margaret Edith",19.0,30.0000,female,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,23.4500,female,0
889,890,"Behr, Mr. Karl Howell",26.0,30.0000,male,1
890,891,"Dooley, Mr. Patrick",32.0,7.7500,male,0

In [ ]:
# display just the first few rows
data.head() # data.head(10)

In [ ]:
# additional data display options
data.info()
data.describe()

In [ ]:
# let's go deeper...

In [ ]:
data['name'] # able to access a single column/attribute from the data frame

In [ ]:
data['name'].head()

In [ ]:
# summarize an attribute
data['age'].sum()
data['age'].mean()

In [ ]:
# grab a row
data.iloc[3] # vs data.iloc[3]

In [ ]:
# grab several rows
data.iloc[1:8]

In [ ]:
data['survived'] == 1

In [ ]:
survivors = data['survived'] == 1
data.loc[survivors]

In [ ]:
# how do I get average age of survivors?

In [ ]:
# multiple selects
(data['survived'] == 1) & (data['sex'] == 'female')

In [ ]:
female_survivors = (data['survived'] == 1) & (data['sex'] == 'female')
data.loc[female_survivors]

In [ ]:
# how many males did not survive and had an age below 35